emptyDomain/testCase/system/internalCloudUUpstream
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields at a cloud of points, interpolated to
    specified boundary patches.

\*---------------------------------------------------------------------------*/

fields ( U );

points
(
    #include "../../ExpTPU/probeUUpstream"
);

#includeEtc "caseDicts/postProcessing/probes/internalCloud.cfg"

interpolationScheme    cellPoint;

setFormat    raw;

writeControl    timeStep;

// ************************************************************************* //
